{
  "backend/main.mo": "Main backend actor implementing a fantasy RPG game with user profiles, character creation (races/classes/stats), quests, guilds, crafting, marketplace transactions, weather system, and Stripe payment integration using authorization and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including 3D open world with biomes, day-night cycle, weather system, combat controls, dialogue system, and resource gathering, all mapped to test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files describing their purpose, from routing and layout to game pages (character creation, 3D world, quests, guilds, crafting, marketplace, store) and payment flows.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark fantasy RPG theme using OKLCH color values for purple/pink gradients, borders, and UI elements in both light and dark modes.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Realm of Legends' title, root div, and module script loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, character creation, game world, quests, guilds, crafting, marketplace, store, and payment pages, wrapped in ThemeProvider with dark theme and toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo and navigation (Play, Quests, Guilds, Crafting, Marketplace, Store), Internet Identity authentication button, profile setup modal trigger, and footer with attribution link.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only component for configuring Stripe payment settings including secret key and allowed countries. Displays appropriate messages for non-authenticated or non-admin users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name to create a user profile. Saves profile with timestamp and displays welcome message on success.",
  "frontend/src/components/World3D.tsx": "React Three Fiber component rendering a 3D game world with a rotating player sphere, ground plane, environment boxes, and randomly positioned trees. Uses drei helpers for geometry primitives.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validity. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including user profiles, characters, quests, guilds, transactions, shopping items, and Stripe configuration. Provides both query and mutation hooks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (colors, borders, shadows) in both light and dark modes. Imports Google Fonts (Cinzel for headings, Inter for body text).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/CharacterCreationPage.tsx": "Character creation page with form for name, race (human/elf/dwarf), class (warrior/mage/ranger), and appearance customization. Submits character data via mutation and navigates to game on success.",
  "frontend/src/pages/CraftingPage.tsx": "Crafting interface displaying resource inventory (wood, iron, leather, herbs) and recipes for items like swords, shields, and potions. Allows crafting if sufficient materials are available.",
  "frontend/src/pages/GamePage.tsx": "Main 3D game world page using React Three Fiber with Canvas, Sky, Environment, and OrbitControls. Renders World3D component with UI overlay showing controls.",
  "frontend/src/pages/GuildsPage.tsx": "Guild management page displaying all guilds with create and join functionality. Shows guild members, leader status, and uses mutations for guild operations.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section featuring background image, call-to-action buttons for character creation and entering game, plus feature cards highlighting combat, quests, and multiplayer.",
  "frontend/src/pages/MarketplacePage.tsx": "Marketplace page with search functionality, mock item listings for purchase, and transaction history display. Uses mutations to create transactions when purchasing items.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure screen with error icon and buttons to retry payment or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation screen with success icon and button to return to game.",
  "frontend/src/pages/QuestsPage.tsx": "React component displaying main and side quests in tabbed interface, allowing authenticated users to view quest details (title, description, rewards) and mark quests as complete.",
  "frontend/src/pages/StorePage.tsx": "React component for premium store page that displays purchasable items (cosmetics, battle pass, premium membership) and integrates Stripe checkout for payments after verifying payment configuration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended theme with custom animations, shadows, fonts (Inter, Cinzel), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for 'Realm of Legends' mobile action RPG defining architectural notes, existing features (3D world, combat, weather, quests, store), and required fantasy-themed image assets for UI and environments."
}